# Тема уроку: робота з цілими числами
# 1. Операція зведення у ступінь
# 2. Операція перебування залишку
# 3. Операція цілісного поділу
# 4. Обробка цифр числа
# 5. Вирішення задач

# Анотація.  Урок присвячений додатковим операціям під час роботи з цілими числами.
# Вивчимо додаткові операції, а також навчимося обробляти цифри цілого числа.

# Додаткові операції
# **	Зведення в ступінь
# %	    Залишок від ділення
# //	Цілочисельний поділ


# Зведення в ступінь
# Оператор зведення у ступінь a ** n зводить числоay ступіньn. Розглянемо роботу даного оператора на прикладах:


# print(2 ** 0)
# print(2 ** 1)
# print(2 ** 2)
# print(2 ** 3)
# print(2 ** (-1))


# Оператор зведення в ступінь ( **) є правоасоціативним (значення виразу обчислюється праворуч наліво)
# відповідно до правил математики. Таким чином, вираз  x ** y ** z обчислюється як  x ** (y ** z).

# print(2 ** 2 ** 3)     # 2 ** (2 ** 3) = 2 ** 8


# Цілочисельний поділ
# Для позитивних чисел оператор целочисленного поділу поводиться як звичайне поділ, крім те,
# що він відкидає десяткову частину результату. Розглянемо роботу даного оператора на прикладах:


# print(10 // 3)
# print(10 // 4)
# print(10 // 5)
# print(10 // 6)
# print(10 // 12)


# Поділ із залишком
# Оператор поділу із залишком повертає залишок від поділу двох цілих чисел.
# Розглянемо роботу даного оператора на прикладах:


# print(10 % 3)
# print(10 % 4)
# print(10 % 5)
# print(10 % 6)
# print(10 % 12)
# print(10 % 20)


# Примітки
# Примітка 1. Оператор знаходження залишку дуже корисний під час вирішення багатьох завдань.
# Наприклад, число поділяється на n націло тоді і тільки тоді, коли залишок від поділу на n дорівнює 0
# Примітка 2. Оператори //мають %такий же пріоритет, як і оператори множення і звичайного поділу.
# Примітка 3. Найвищий пріоритет має оператор зведення у ступінь **.
# Примітка 4. Корисно прочитати про модульну математику в математиці.
# Примітка 5. Зверніть увагу: результатом поділу  n % m є  n < m число n. Наприклад, 5 % 9 = 5, 3 % 13 = 3і т.д.


# Неправильно:

# print(10 / 3)  # печатает 3.3333333333333335


# Правильно:

# print(10 // 3)  # печатает 3


# /– це операція звичайного (або «плаваючого») дії.
# В результаті звичайного деления отримується десятична дробь, а не целое число.
# Детальніше числа з плаваючою точкою і оператором /ми вибираємо далі в курсі.


# Чтение входного значения
# p = int(input())

# Вычисление номера купе
# compartment_number = (p - 1) // 4 + 1

# Вывод результата
# print(compartment_number)


# Чтение входного значения
# number = input()

# Извлечение цифр числа

num1, num2, num3, num4 = input()

print("Цифра в позиции тысяч:", num1)
print("Цифра в позиции тысяч:", num2)
print("Цифра в позиции тысяч:", num3)
print("Цифра в позиции тысяч:", num4)


