# # Тема уроку: робота з цілими числами
# # 1. Цілочисельний тип даних
# # 2. Перетворення рядка до цілого числа
# # 3. Операції над цілими числами
# # 4. Вирішення задач
# # Анотація. Урок присвячений вивченню роботи з цілими числами.
# # Вивчимо основні операції, а також навчимося перетворювати рядки на числа.
#
#
# # Целые числа
#
#
# num1 = 7                # num1 - это число
# num2 = 10               # num2 - это число
# num3 = num1 + num2      # num3 - это число
#
# print(num3)
#
#
# # Запам'ятай: числа позначаються без лапок, а рядки — з лапками
#
#
# # У мові Python, як і математики, над числами можна здійснювати 4 основні операції (+, -, *, /).
# # + додавання
# # - віднімання
# # * множення
# # / поділ


# a = 3
# b = 2
# print(a + b)
# print(a - b)
# print(a * b)
# print(a / b)
#
#
# # Порядок виконання операцій
# # У математиці існує порядок виконання операцій, що визначає, які операції повинні виконуватися раніше за інших,
# # навіть якщо у виразі вони написані правіше.
# # Порядок виконання операцій у Python аналогічний порядку виконання операцій, які ви вивчали під час уроків математики.


# num1 = 2 + 3 * 4
# num2 = (2 + 3) * 4
# print(num1)
# print(num2)
#
#
# # У змінній num1 зберігатиметься число 14, оскільки насамперед виконується множення, а вже потім додавання.
# # У змінній num2 зберігатиметься число 20, оскільки дужки змінили пріоритет виконання операцій
# # первым делом выполняется умножение или деление, затем сложение и вычитание.
# # Для изменения порядка выполнения операций понадобятся скобки.



# Перетворення рядка до цілого числа
# Щоб перетворити рядок до цілого числа, ми використовуємо команду int().


# s = "1992"
# year = int(s)

# print(year)


# num1 = int(input())
# num2 = int(input())
#
# print(num1 + num2)


# Перетворення цілого числа на рядок
# Щоб перетворити ціле число в рядок, ми використовуємо команду str(). Розглянемо наступний код:


# num = 17
# s = str(num)  # тепер s містить рядок '17'


# Скорочення int походить від англійського integer – цілий.


# Примітка 4. Мінус може бути використаний для позначення негативних чисел.
# А ось операції +, / і * завжди стоять між двома змінними та щось із ними роблять.


# num1 = -6  # унарний мінус
# num2 = 17 - 7 # бінарний мінус


# s = 0
# k = 30
# d = k - 5
# k = 2 * d
# s = k - 100
#
# print(s)


# x = 3
# y = 4
# z = x + y
# z = z + 1
# x = y
# y = 5
# x = z + y + 7
# print(x)


# a = int(input())
# b = a + 1
# c = a + 2
# print()

# mon = int(input())
# pc_case = int(input())
# keyboard = int(input())
# mouse = int(input())
# full_pc = mon + pc_case + keyboard + mouse
#
# print(full_pc * 3)

# num1 = int(input())
# num2 = int(input())
# print(num1, "+", num2, "=", num1 + num2)
# print(num1, "-", num2, "=", num1 - num2)
# print(num1, "*", num2, "=", num1 * num2)


# a1 = int(input())
# d = int(input())
# n = int(input())
# print(a1+d*(n-1))


# x = int(input())
#
# print(x, x * 2, x * 3, x * 4, x * 5, sep="---")
