# Тема уроку: введення-виведення даних
# 1.Виведення даних, команда print()
# 2.Введення даних, команда input()
# 3.Змінні
# 4.Вирішення задач


# Виведення даних, команда print()
print("My first word")


# Те, що ми пишемо у круглих дужках у команди print(), називається аргументами команди
# Команда print() дозволяє вказувати кілька аргументів, у разі їх треба відокремлювати комами

print("Car", "Cat", "Dog", "Mouse")


# Примітка. Чому можна використовувати Python як одинарні, так і подвійні лапки для обрамлення тексту? Відповідь дуже
# проста — часто лапки є частиною тексту. І щоб Python міг правильно розпізнати такий текст, користуємося різними:
# якщо в тексті потрібні одинарні лапки, для обрамлення такого тексту використовуємо подвійні лапки;
# якщо тексті потрібні подвійні лапки, то обрамляємо його одинарними

print('"Good morning"')

print("'Good morning'")



# Введення даних, команда input(), змінні
# Усі попередні програми виводили на екран текст, відомий на момент написання програмного коду.
# Однак програми можуть працювати з даними, які стануть відомими лише під час виконання програми.
# Іншими словами, програми можуть зчитувати дані, а потім їх використовувати.
# Для зчитування даних у мові Python використовується команда input()

print("What is your name ?")

print("Hello,", input())


# Змінні
# оманда input() означає: "почекай, поки користувач введе щось з клавіатури, і запам'ятай те, що він ввів".
# Просто так просити "запам'ятати" досить безглуздо: адже нам потім треба буде якось сказати комп'ютеру,
# щоб він згадав те, що запам'ятав! Для цього ми використовуємо змінні та пишемо наступний код:

variable_name = input()
print("Your text is", variable_name)


# Змінні у команді print()
# Як ви помітили, ми можемо використовувати змінні у команді print().
# Для цього ми просто вказуємо ім'я змінної без лапок усередині круглих дужок як аргумент.

city = "Ternopil"
print(city, "is my city")


name = "Oleksandr"
city = "Ternopil"
print("My name is", name, ".", "I live in city", city,)



# Ім'я змінної
# 1.В імені змінної рекомендується використовувати лише латинські літери a-z, A-Z, цифри та символ нижнього підкреслення (_)
# 2.Ім'я змінної не може починатися з цифри
# 3.Ім'я змінної не може містити прогалини
# 4.Ім'я змінної по можливості має відображати її призначення
# Запам'ятай: Python - регістрочутлива мова. Змінна name і Name – дві абсолютно різні змінні.

# Для назви змінних прийнято використовувати стиль lower_case_with_underscores (слова з невеликих літер з підкресленнями).
# Наприклад, такі імена для змінних хороші:

# server_response
# is_password_good
# username
# cyberpunk_77



# Значення змінної
# Значення змінної - це збережена у ній інформація: текст, число тощо.
# Символ = у мовах програмування виступає у ролі оператора присвоювання.
# Він виконує завдання зв'язування значення, розташованого праворуч від нього, з ім'ям змінної, вказаної зліва.
# Таким чином, змінна зліва "приймає" або "зберігає" значення, представлене виразом праворуч від знака =:

print("What is your name?")
name = input()
print("My name is,", name)
name = "Oleksandr"
print("Hi,", name)

name_1 = input()
print("Hello", name_1)
