# Тема уроку: введення-виведення даних
# 1.Виведення даних, команда print()
# 2.Введення даних, команда input()
# 3.Змінні
# 4.Вирішення задач


# Виведення даних, команда print()
print("My first word")


# Те, що ми пишемо у круглих дужках у команди print(), називається аргументами команди
# Команда print() дозволяє вказувати кілька аргументів, у разі їх треба відокремлювати комами

print("Car", "Cat", "Dog", "Mouse")


# Примітка. Чому можна використовувати Python як одинарні, так і подвійні лапки для обрамлення тексту? Відповідь дуже
# проста — часто лапки є частиною тексту. І щоб Python міг правильно розпізнати такий текст, користуємося різними:
# якщо в тексті потрібні одинарні лапки, для обрамлення такого тексту використовуємо подвійні лапки;
# якщо тексті потрібні подвійні лапки, то обрамляємо його одинарними

print('"Good morning"')
print("'Good morning'")


